todo.org
Snail's Todo List


* 个人安排
** 学习emacs
*** 学习org模式

** 算法导论
*** 2014/6/29 复习排序
**** TODO 快排
**** TODO 归并
**** TODO 堆排
**** TODO 冒泡插入


** 小项目
*** DONE 实现TODO同步功能
   CLOSED: [2014-06-23 一 13:06]
   - State "DONE"       from "TODO"       [2014-06-23 一 13:06]

** 黑米
*** DONE 添加全局自动更新功能
    CLOSED: [2014-06-29 日 21:23]
    - State "DONE"       from ""           [2014-06-29 日 21:23]

*** TODO 中文表达式解析功能
*** TODO 软件加密





* 实验室项目

** 2014/6/18
*** DONE 安装OpenCV SuitSparse
    CLOSED: [2014-06-19 四 11:11]
    - State "DONE"       from "TODO"       [2014-06-19 四 11:11]
*** DONE 选择IDE,开始重新编写抠图算法
    CLOSED: [2014-06-19 四 11:11]
    - State "DONE"       from "TODO"       [2014-06-19 四 11:11]


** 2014/6/19
*** DONE 移植CXSparse
    CLOSED: [2014-06-21 六 10:46]
    - State "DONE"       from "TODO"       [2014-06-21 六 10:46]

** 2014/6/21
*** DONE 完成抠图部分算法
    CLOSED: [2014-06-21 六 18:50]
    - State "DONE"       from "TODO"       [2014-06-21 六 18:50]




** 2014/6/22
*** DONE 完成稀疏矩阵特征值分解
    CLOSED: [2014-06-22 日 17:44]
    - STATE "DONE"       FROM ""           [2014-06-22 日 17:44]

*** DONE 服务器与GIT同步
    CLOSED: [2014-06-22 日 17:46]
    - STATE "DONE"       FROM "TODO"       [2014-06-22 日 17:46]


** 2014/6/23
*** DONE 完成trackball
     CLOSED: [2014-06-24 二 00:41]
     - State "DONE"       from "TODO"       [2014-06-24 二 00:41]


** 2014/6/24
*** DONE 完成深度图绘制
    CLOSED: [2014-06-29 日 09:24]
    - State "DONE"       from "TODO"       [2014-06-29 日 09:24]


** 2014/6/29
*** DONE 修复显示y轴显示问题
    CLOSED: [2014-06-29 日 21:22]
    - State "DONE"       from "TODO"       [2014-06-29 日 21:22]
*** DONE 添加dismap生成算法
    CLOSED: [2014-06-29 日 21:22]
    - State "DONE"       from "TODO"       [2014-06-29 日 21:22]

** 2014/6/30
*** TODO 前后景分离算法

* 思考
** TODOLIST 如何使用
#+BEGIN_SRC cpp
   1.任务完成度
     每天可以写很多任务，尽量保证每分钟都知道在完成哪个任务即可。
     没必要完成每个任务，*更没必要因为任务没完成而自责*。
     任务不能完成一般能归结为2个原因：
       1. 计划制定不够完善
          1. 任务安排得过多？
          2. 任务安排得过于模糊？时间难以把控？
          3. 计划顺序有问题？波动性大？
          4. 有新任务加入？有计划外情况影响整个计划列表执行？
       2. 执行力没达到预期
          1. 短板在那里？
          2. 贪玩？为什么贪玩？因为计划不够详细？精力不够？
          3. 遇到难以解决的问题？什么问题？为什么难以解决？下次计划的时候能不能把问题解决计划加入计划列表？
             完成任务后，记得做笔记：
               1. 问题描述
               2. 解决步骤
               3. 解决结果
               4. 相关资源链接
     TODOlist 是一个任务记录工具，能够帮助自己了解每天完成了哪些事情。效率如何。
     每天没完成的任务，可以分为两类：
       1. 不需要再完成了。删除即可。（常见于日常琐碎任务）
       2. 需要改日完成：移动到当天的TODOlist即可

   2.任务如何安排
     1. 任务分类： 项目 学习 临时任务
     2. 任务尽可能分解到时间可预测的粒度
        如：
           完成XX类
            1. TODO 完成 xxx method
            2. TODO 完成 yyy method



  3. 任务尽可能按照难易程度排序执行，防止较难的任务影响较易的任务执行
#+END_SRC


* 笔记
** 如何使用EMACS编辑远程文件
#+BEGIN_SRC CPP
1. 启动EMACS
2. 按下CTRL+C F
3. 在MINI-BUFFER中输入要编辑的文件，有以下几种格式
   1./HOST:FILEPATH
   2./USER@HOST:FILEPATH
   3./USER@HOST#PORT:FILEPATH
   4./METHOD:USER@HOST:FILEPATH
   5./METHOD:USER@HOST#PORT:FILEPATH

   我使用了 /ROOT@LSSNAIL.INFO:~ 来连接到服务器ROOT用户的HOME目录
   回车之后，输入SSH密码即可
   不过在ORG模式CTRL+C E H导出HTML时，提示无法导出，还不知道是什么问题。
#+END_SRC


** 下载并使用PURCELL的EMACS配置文件
#+BEGIN_SRC CPP
   GIT CLONE HTTPS://GITHUB.COM/PURCELL/EMACS.D.GIT ~/.EMACS.D
#+END_SRC


***nix下 .bashrc配置
#+BEGIN_SRC bash
   alias ll='ls -lG'
   alias la='ls -aG'
   if [ $(pwd) = $HOME ]
   then
       cd ./Desktop
   fi
#+END_SRC


** cmake 使用pkg-config添加库
#+BEGIN_SRC cpp
   ====================== 方法1 ====================
   find_package(PkgConfig)
   #------------------ modules (pkg-config)------------
   pkg_check_modules(OPENCV REQUIRED opencv)


   #------------------ include dirs ------------------
   include_directories(
   "${OPENCV_INCLUDE_DIRS}"
   )

   #------------------ library dirs ------------------
   link_directories(
   )

   #------------------ libraries --------------------
   target_link_libraries (${PROJECT_NAME}
   ${OPENCV_LDFLAGS}
   )
   ====================== 方法2 =====================

   cmake_minimum_required(VERSION 2.8)
   project( DisplayImage )
   find_package( OpenCV REQUIRED )
   add_executable( DisplayImage DisplayImage.cpp )
   target_link_libraries( DisplayImage ${OpenCV_LIBS} )

#+END_SRC


** Qt Creator + CMake 不能调试
#+BEGIN_SRC cpp
Qt Creator创建CMake项目的时候，在参数里边添加一行
-DCMAKE_BUILD_TYPE=Debug
#+END_SRC

** 修改ssh默认端口
#+BEGIN_SRC cpp
vi /etc/ssh/sshd_config 修改Port 22到想要的端口
/etc/init.d/ssh restart 重启
#+END_SRC
