todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Snail's Todo List</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Snail's Todo List"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-29T21:24+0800"/>
<meta name="author" content="黄攀"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Snail's Todo List</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 个人安排</a>
<ul>
<li><a href="#sec-1-1">1.1 学习emacs</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 学习org模式</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 算法导论</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 2014/6/29 复习排序</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 小项目</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 实现TODO同步功能</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 黑米</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 添加全局自动更新功能</a></li>
<li><a href="#sec-1-4-2">1.4.2 中文表达式解析功能</a></li>
<li><a href="#sec-1-4-3">1.4.3 软件加密</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 实验室项目</a>
<ul>
<li><a href="#sec-2-1">2.1 2014/6/18</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 安装OpenCV SuitSparse</a></li>
<li><a href="#sec-2-1-2">2.1.2 选择IDE,开始重新编写抠图算法</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 2014/6/19</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 移植CXSparse</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 2014/6/21</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 完成抠图部分算法</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 2014/6/22</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 完成稀疏矩阵特征值分解</a></li>
<li><a href="#sec-2-4-2">2.4.2 服务器与GIT同步</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 2014/6/23</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 完成trackball</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6 2014/6/24</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1 完成深度图绘制</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7 2014/6/29</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1 修复显示y轴显示问题</a></li>
<li><a href="#sec-2-7-2">2.7.2 添加dismap生成算法</a></li>
</ul>
</li>
<li><a href="#sec-2-8">2.8 2014/6/30</a>
<ul>
<li><a href="#sec-2-8-1">2.8.1 前后景分离算法</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 思考</a>
<ul>
<li><a href="#sec-3-1">3.1 TODOLIST 如何使用</a></li>
</ul>
</li>
<li><a href="#sec-4">4 笔记</a>
<ul>
<li><a href="#sec-4-1">4.1 如何使用EMACS编辑远程文件</a></li>
<li><a href="#sec-4-2">4.2 下载并使用PURCELL的EMACS配置文件</a></li>
<li><a href="#sec-4-3">4.3 cmake 使用pkg-config添加库</a></li>
<li><a href="#sec-4-4">4.4 Qt Creator + CMake 不能调试</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 个人安排</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 学习emacs</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 学习org模式</h4>
<div class="outline-text-4" id="text-1-1-1">


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 算法导论</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 2014/6/29 复习排序</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li id="sec-1-2-1-1"><span class="todo TODO">TODO</span> 快排<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-1-2"><span class="todo TODO">TODO</span> 归并<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-1-3"><span class="todo TODO">TODO</span> 堆排<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-1-4"><span class="todo TODO">TODO</span> 冒泡插入<br/>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 小项目</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> <span class="done DONE">DONE</span> 实现TODO同步功能</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-23 一 13:06</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-23 一 13:06</span></span>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 黑米</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> <span class="done DONE">DONE</span> 添加全局自动更新功能</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-29 日 21:23</span></span><br/>
</p><ul>
<li>State "DONE"       from "" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-29 日 21:23</span></span>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> <span class="todo TODO">TODO</span> 中文表达式解析功能</h4>
<div class="outline-text-4" id="text-1-4-2">

</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> <span class="todo TODO">TODO</span> 软件加密</h4>
<div class="outline-text-4" id="text-1-4-3">






</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 实验室项目</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 2014/6/18</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <span class="done DONE">DONE</span> 安装OpenCV SuitSparse</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-19 四 11:11</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-19 四 11:11</span></span>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <span class="done DONE">DONE</span> 选择IDE,开始重新编写抠图算法</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-19 四 11:11</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-19 四 11:11</span></span>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 2014/6/19</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> <span class="done DONE">DONE</span> 移植CXSparse</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-21 六 10:46</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-21 六 10:46</span></span>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 2014/6/21</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="done DONE">DONE</span> 完成抠图部分算法</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-21 六 18:50</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-21 六 18:50</span></span>
</li>
</ul>





</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 2014/6/22</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="done DONE">DONE</span> 完成稀疏矩阵特征值分解</h4>
<div class="outline-text-4" id="text-2-4-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-22 日 17:44</span></span><br/>
</p><ul>
<li>STATE "DONE"       FROM "" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-22 日 17:44</span></span>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> <span class="done DONE">DONE</span> 服务器与GIT同步</h4>
<div class="outline-text-4" id="text-2-4-2">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-22 日 17:46</span></span><br/>
</p><ul>
<li>STATE "DONE"       FROM "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-22 日 17:46</span></span>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 2014/6/23</h3>
<div class="outline-text-3" id="text-2-5">


</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> <span class="done DONE">DONE</span> 完成trackball</h4>
<div class="outline-text-4" id="text-2-5-1">

<p>      <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-24 二 00:41</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-24 二 00:41</span></span>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 2014/6/24</h3>
<div class="outline-text-3" id="text-2-6">


</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> <span class="done DONE">DONE</span> 完成深度图绘制</h4>
<div class="outline-text-4" id="text-2-6-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-29 日 09:24</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-29 日 09:24</span></span>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 2014/6/29</h3>
<div class="outline-text-3" id="text-2-7">


</div>

<div id="outline-container-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> <span class="done DONE">DONE</span> 修复显示y轴显示问题</h4>
<div class="outline-text-4" id="text-2-7-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-29 日 21:22</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-29 日 21:22</span></span>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> <span class="done DONE">DONE</span> 添加dismap生成算法</h4>
<div class="outline-text-4" id="text-2-7-2">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-06-29 日 21:22</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2014-06-29 日 21:22</span></span>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 2014/6/30</h3>
<div class="outline-text-3" id="text-2-8">


</div>

<div id="outline-container-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> <span class="todo TODO">TODO</span> 前后景分离算法</h4>
<div class="outline-text-4" id="text-2-8-1">


</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 思考</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> TODOLIST 如何使用</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-cpp"> 1.&#20219;&#21153;&#23436;&#25104;&#24230;
   &#27599;&#22825;&#21487;&#20197;&#20889;&#24456;&#22810;&#20219;&#21153;&#65292;&#23613;&#37327;&#20445;&#35777;&#27599;&#20998;&#38047;&#37117;&#30693;&#36947;&#22312;&#23436;&#25104;&#21738;&#20010;&#20219;&#21153;&#21363;&#21487;&#12290;
   &#27809;&#24517;&#35201;&#23436;&#25104;&#27599;&#20010;&#20219;&#21153;&#65292;*&#26356;&#27809;&#24517;&#35201;&#22240;&#20026;&#20219;&#21153;&#27809;&#23436;&#25104;&#32780;&#33258;&#36131;*&#12290;
   &#20219;&#21153;&#19981;&#33021;&#23436;&#25104;&#19968;&#33324;&#33021;&#24402;&#32467;&#20026;2&#20010;&#21407;&#22240;&#65306;
     1. &#35745;&#21010;&#21046;&#23450;&#19981;&#22815;&#23436;&#21892;
        1. &#20219;&#21153;&#23433;&#25490;&#24471;&#36807;&#22810;&#65311;
        2. &#20219;&#21153;&#23433;&#25490;&#24471;&#36807;&#20110;&#27169;&#31946;&#65311;&#26102;&#38388;&#38590;&#20197;&#25226;&#25511;&#65311;
        3. &#35745;&#21010;&#39034;&#24207;&#26377;&#38382;&#39064;&#65311;&#27874;&#21160;&#24615;&#22823;&#65311;
        4. &#26377;&#26032;&#20219;&#21153;&#21152;&#20837;&#65311;&#26377;&#35745;&#21010;&#22806;&#24773;&#20917;&#24433;&#21709;&#25972;&#20010;&#35745;&#21010;&#21015;&#34920;&#25191;&#34892;&#65311;
     2. &#25191;&#34892;&#21147;&#27809;&#36798;&#21040;&#39044;&#26399;
        1. &#30701;&#26495;&#22312;&#37027;&#37324;&#65311;
        2. &#36138;&#29609;&#65311;&#20026;&#20160;&#20040;&#36138;&#29609;&#65311;&#22240;&#20026;&#35745;&#21010;&#19981;&#22815;&#35814;&#32454;&#65311;&#31934;&#21147;&#19981;&#22815;&#65311;
        3. &#36935;&#21040;&#38590;&#20197;&#35299;&#20915;&#30340;&#38382;&#39064;&#65311;&#20160;&#20040;&#38382;&#39064;&#65311;&#20026;&#20160;&#20040;&#38590;&#20197;&#35299;&#20915;&#65311;&#19979;&#27425;&#35745;&#21010;&#30340;&#26102;&#20505;&#33021;&#19981;&#33021;&#25226;&#38382;&#39064;&#35299;&#20915;&#35745;&#21010;&#21152;&#20837;&#35745;&#21010;&#21015;&#34920;&#65311;
           &#23436;&#25104;&#20219;&#21153;&#21518;&#65292;&#35760;&#24471;&#20570;&#31508;&#35760;&#65306;
             1. &#38382;&#39064;&#25551;&#36848;
             2. &#35299;&#20915;&#27493;&#39588;
             3. &#35299;&#20915;&#32467;&#26524;
             4. &#30456;&#20851;&#36164;&#28304;&#38142;&#25509;
   TODOlist &#26159;&#19968;&#20010;&#20219;&#21153;&#35760;&#24405;&#24037;&#20855;&#65292;&#33021;&#22815;&#24110;&#21161;&#33258;&#24049;&#20102;&#35299;&#27599;&#22825;&#23436;&#25104;&#20102;&#21738;&#20123;&#20107;&#24773;&#12290;&#25928;&#29575;&#22914;&#20309;&#12290;
   &#27599;&#22825;&#27809;&#23436;&#25104;&#30340;&#20219;&#21153;&#65292;&#21487;&#20197;&#20998;&#20026;&#20004;&#31867;&#65306;
     1. &#19981;&#38656;&#35201;&#20877;&#23436;&#25104;&#20102;&#12290;&#21024;&#38500;&#21363;&#21487;&#12290;&#65288;&#24120;&#35265;&#20110;&#26085;&#24120;&#29712;&#30862;&#20219;&#21153;&#65289;
     2. &#38656;&#35201;&#25913;&#26085;&#23436;&#25104;&#65306;&#31227;&#21160;&#21040;&#24403;&#22825;&#30340;TODOlist&#21363;&#21487;

 2.&#20219;&#21153;&#22914;&#20309;&#23433;&#25490;
   1. &#20219;&#21153;&#20998;&#31867;&#65306; &#39033;&#30446; &#23398;&#20064; &#20020;&#26102;&#20219;&#21153;
   2. &#20219;&#21153;&#23613;&#21487;&#33021;&#20998;&#35299;&#21040;&#26102;&#38388;&#21487;&#39044;&#27979;&#30340;&#31890;&#24230;
      &#22914;&#65306;
         &#23436;&#25104;XX&#31867;
          1. TODO &#23436;&#25104; xxx method
          2. TODO &#23436;&#25104; yyy method



3. &#20219;&#21153;&#23613;&#21487;&#33021;&#25353;&#29031;&#38590;&#26131;&#31243;&#24230;&#25490;&#24207;&#25191;&#34892;&#65292;&#38450;&#27490;&#36739;&#38590;&#30340;&#20219;&#21153;&#24433;&#21709;&#36739;&#26131;&#30340;&#20219;&#21153;&#25191;&#34892;
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 笔记</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 如何使用EMACS编辑远程文件</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-CPP">1. &#21551;&#21160;EMACS
2. &#25353;&#19979;CTRL+C F
3. &#22312;MINI-BUFFER&#20013;&#36755;&#20837;&#35201;&#32534;&#36753;&#30340;&#25991;&#20214;&#65292;&#26377;&#20197;&#19979;&#20960;&#31181;&#26684;&#24335;
   1./HOST:FILEPATH
   2./USER@HOST:FILEPATH
   3./USER@HOST#PORT:FILEPATH
   4./METHOD:USER@HOST:FILEPATH
   5./METHOD:USER@HOST#PORT:FILEPATH

   &#25105;&#20351;&#29992;&#20102; /ROOT@LSSNAIL.INFO:~ &#26469;&#36830;&#25509;&#21040;&#26381;&#21153;&#22120;ROOT&#29992;&#25143;&#30340;HOME&#30446;&#24405;
   &#22238;&#36710;&#20043;&#21518;&#65292;&#36755;&#20837;SSH&#23494;&#30721;&#21363;&#21487;
   &#19981;&#36807;&#22312;ORG&#27169;&#24335;CTRL+C E H&#23548;&#20986;HTML&#26102;&#65292;&#25552;&#31034;&#26080;&#27861;&#23548;&#20986;&#65292;&#36824;&#19981;&#30693;&#36947;&#26159;&#20160;&#20040;&#38382;&#39064;&#12290;
</pre>



</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 下载并使用PURCELL的EMACS配置文件</h3>
<div class="outline-text-3" id="text-4-2">




<pre class="src src-CPP">GIT CLONE HTTPS://GITHUB.COM/PURCELL/EMACS.D.GIT ~/.EMACS.D
</pre>



<p>
***nix下 .bashrc配置
</p>


<pre class="src src-bash">alias ll='ls -lG'
alias la='ls -aG'
if [ $(pwd) = $HOME ]
then
    cd ./Desktop
fi
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> cmake 使用pkg-config添加库</h3>
<div class="outline-text-3" id="text-4-3">




<pre class="src src-cpp">====================== &#26041;&#27861;1 ====================
find_package(PkgConfig)
#------------------ modules (pkg-config)------------
pkg_check_modules(OPENCV <span style="color: #268bd2;">REQUIRED</span> <span style="color: #6c71c4;">opencv</span>)


#------------------ include dirs ------------------
include_directories(
<span style="color: #2aa198;">"${OPENCV_INCLUDE_DIRS}"</span>
)

#------------------ library dirs ------------------
link_directories(
)

#------------------ libraries --------------------
target_link_libraries (${PROJECT_NAME}
${OPENCV_LDFLAGS}
)
====================== &#26041;&#27861;2 =====================

cmake_minimum_required(VERSION 2.8)
project( DisplayImage )
find_package( <span style="color: #268bd2;">OpenCV</span> <span style="color: #6c71c4;">REQUIRED</span> )
add_executable( <span style="color: #268bd2;">DisplayImage</span> <span style="color: #6c71c4;">DisplayImage</span>.cpp )
target_link_libraries( DisplayImage ${OpenCV_LIBS} )

</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Qt Creator + CMake 不能调试</h3>
<div class="outline-text-3" id="text-4-4">




<pre class="src src-cpp"><span style="color: #268bd2;">Qt</span> <span style="color: #6c71c4;">Creator&#21019;&#24314;CMake&#39033;&#30446;&#30340;&#26102;&#20505;</span>&#65292;&#22312;&#21442;&#25968;&#37324;&#36793;&#28155;&#21152;&#19968;&#34892;
-DCMAKE_BUILD_TYPE=Debug
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-06-29T21:24+0800</p>
<p class="author">Author: 黄攀</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
